<!DOCTYPE html>
<html>
<head>
<title>Article, section y aside</title>
<meta charset="UTF-8">
</head>
<body>
<div>
<header>
<h1>Article, section y aside</h1>
</header>
<section>
<h2>El elemento Article</h2>
<p>El elemento <strong>article</strong> es una pieza aut&oacute;noma, de contenido independiente que puede ser usada y distribuida separadamente del resto de la p&aacute;gina. Esto podr&iacute;a ser un post de un foro, una revista o un art&iacute;culo de revista, una entrada de blog, un comentario un widget interactivo o gadget, o cualquier otra ppieza de contenido independiente.<br/>
Este elemento reemplaza a <em>div</em>. Tambi&eacute;n puede anidarse (contenerse un <b>article</b> dentro de otro).</p>
</section>
<section>
<h2>El elemento Section</h2>
<p><strong>section</strong> es un contenedor l&oacute;gico de la p&aacute;gina web o art&iacute;culo. Las secciones pueden ser usadas para dividir contenido dentro de un art&iacute;culo.<br/>
Por ejemplo, una p&aacute;gina principal podr&iacute;a tener una secci&oacute;n para introducir a la compa&ntilde;&iacute;a, otra para items de noticias y tambi&eacute;n otra para la informaci&oacute;n de contacto.<br/>
Cada <strong>section</strong> deber&iacute;a ser identificada, t&iacute;picamente incluyendo un encabezado (elemento <b>h1-h6</b>) como un hijo del elemento <strong>section</strong>.<br/>
Si tiene sentido ubicar separadamente el contenido de un elemento <b>section</b>, usar mejor un elemento <b>article</b>.</p>
</section>
<section>
<h2>El elemento Aside</h2>
<p><strong>aside</strong> es contenido secundario o tangencial que podr&iacute;a ser considerado separado pero inderectamente relacionado al contenido principal<br/>
Este tipo de contenido es a veces representado en barras laterales. Cuando una etiqueta <b>aside</b> es usada dentro de una etiqueta <b>article</b>, el contenido de <b>aside</b> deber&iacute;a estar espec&iacute;ficamente relacionado a ese art&iacute;culo.<br/>
Cuando una etiqueta <b>aside</b> es usada fuera de una etiqueta <b>article</b> su contenido deber&acute;a estar relacionado al contenido que ets&aacute; a su alrededor.</p>
</section>
</div>
</body>
</html>